[
  {
    "index": 0,
    "cover": "image",
    "coverSource": "/RDD.png",
    "title": "Digital Didactic Resource",
    "startYear": 2024,
    "endYear": 2024,
    "description": "Single page application developed in Angular 13 with Bootstrap 4 as part of the tasks performed during social service. Some of the tasks performed were front-end development using Gitflow and GitHub Projects, multiple environment configuration, among others.",
    "href": "https://gentle-ocean-0ee8b0410.4.azurestaticapps.net/"
  },
  {
    "index": 1,
    "cover": "image",
    "coverSource": "/Democracyte.png",
    "title": "Democracyte",
    "startYear": 2022,
    "endYear": 2024,
    "description": "Web tool to support e-democracy processes using Blockchain. Leader of team-based degree work consisting of a website, a functions application (FaaS), a NoSQL database and a smart contract using SCRUM as framework and software methodology.",
    "href": "https://green-bush-09a621510.3.azurestaticapps.net/"
  },
  {
    "index": 2,
    "cover": "image",
    "coverSource": "/SpaceRide.png",
    "title": "Space Ride",
    "startYear": 2019,
    "endYear": 2019,
    "description": "Spaceship fighting game featured in a desktop application with a didactic quiz within a web application and display of results statistics in a mobile application. team-based degree work developed with XP methodology and featuring a SQL database.",
    "href": "https://github.com/rushtechnologies/SpaceRide"
  },
  {
    "index": 5,
    "cover": "image",
    "coverSource": "/URadio.jpg",
    "title": "UЯRadio",
    "startYear": 2022,
    "endYear": 2022,
    "description": "A web and mobile information system for the registration by those responsible for music radio programs of the information of the program and the songs that they reproduce during their broadcasts, the consultation of said information by radio listeners and the recognition of song information from audio tracks by the latter (through the use of the ACRCloud API), with the possibility of accessing the identified songs through the Spotify platform (using its API too).",
    "href": "https://github.com/carloshuertag/URadio"
  },
  {
    "index": 6,
    "cover": "image",
    "coverSource": "/Aki.jpg",
    "title": "Aki",
    "startYear": 2021,
    "endYear": 2021,
    "description": "A store management system that allows you to display store inventories, update information, purchase products and generate a user profile.",
    "href": "https://github.com/a-elg/Proyecto_Tienditas"
  },
  {
    "index": 3,
    "cover": "image",
    "coverSource": "/portrait.jpg",
    "title": "Movie Ratings and Reviews",
    "startYear": 2023,
    "endYear": 2023,
    "description": "Alexa Skill that retrieves information from IMDB via WebScrapping about a movie that the user indicates.",
    "href": "https://github.com/carloshuertag/intelligentSystems/blob/main/alexaSkillBot/alexaMovieSkill.ipynb"
  },
  {
    "index": 4,
    "cover": "image",
    "coverSource": "/landscape.jpg",
    "title": "AR Tower Takedown",
    "startYear": 2023,
    "endYear": 2023,
    "description": "Android application that uses image recognition to generate AR brick towers on top of the plane placed right above the recognized image and lets the user throw a ball to bring them down.",
    "href": "https://github.com/carloshuertag/ar-tower-takedown"
  }
]
